app/controllers/api/v1/admin/books_controller.rb

        def get_all_books
          show_response(status: true, books: Book.all )
---
SELECT `books`.* FROM `books`

        def find_books
          show_response(Book.find_books(params))
---
SELECT `books`.* FROM `books` WHERE (1)