app/controllers/api/v1/admin/library_controller.rb

SELECT `libraries`.* FROM `libraries`
---
        def get_all_libraries
          show_response(status: true, msg: "All libraries found", payload: Library.all)